USE `reactmovieplanetdatabase`;
SET SQL_SAFE_UPDATES = 0;


DELETE FROM `movie_review`;
INSERT INTO `movie_review` (`review_id`,`movie_id`,`user_id`,`user_email`,`user_name`,`date`,`rating`,`review_description`) VALUES
(300000, 100001, 200001, '909565441@qq.com', 'silence', '2024-05-22 17:27:03', '4.5', '永恒经典，力荐巨作'),
(300001, 100001, 200026, 'oliviawright26@google.com', 'OliviaWright', '2024-05-23 10:30:58', '5', '有的人的羽翼是如此光辉，即使世界上最黑暗的牢狱，也无法长久地将他围困！'),
(300002, 100002, 200007, 'user006@example.email', 'EvaTaylor', '2024-05-23 11:30:10', '4.5', '张国荣再次成就一部经典。'),
(300003, 100003, 200023, 'matthewtaylor23@google.com', 'MatthewTaylor', '2024-05-23 11:09:47', '4.5', '会永远喜欢阿甘意气风发的样子，他是勇敢善良又对世界充满爱的，他间接或直接的参与了历史大事，也让我明白在世界历史潮流中，每个人都无法挣脱命运'),
(300004, 100004, 200035, 'benjaminwright35@163.com', 'BenjaminWright', '2024-05-23 11:58:57', '4', '时光流转，爱情永恒。作为一部跨越时空的经典之作，在2024年的今天仍然能够触动人们的心弦。'),
(300005, 100005, 200031, 'noahmoore31@example.com', 'NoahMoore', '2024-05-23 08:50:21', '5', '很久之前看的了，甚至忘了讲的什么，但还是会怀念里面的人物'),
(300006, 100006, 200003, 'test002@testmail.net', 'AliceSmith', '2024-04-11 20:47:01', '3.5', '人物很简单，刻画地也很深刻，但主角关系的进展我无法接受。'),
(300007, 100007, 200040, 'oliverbrown40@example.com', 'OliverBrown', '2024-05-23 07:51:56', '4.5', '《美丽人生》是部感人至深的佳作，用幽默和温情诠释了父爱如山。主人公在苦难中保持乐观，为孩子编织美丽谎言，让人泪目。影片不仅是关于战争的反思，更是对人性光辉的赞美。强烈推荐给每一个珍惜爱与和平的人。'),
(300008, 100008, 200022, 'rachelmoore22@163.com', 'RachelMoore', '2024-05-22 22:39:39', '5', '对于不爱看科幻片的我来说，星际穿越给我很大的冲击，缜密的物理宇宙知识与新奇的剧情巧妙融合在一起，再次对诺兰瑞思拜！'),
(300009, 100009, 200023, 'matthewtaylor23@google.com', 'MatthewTaylor', '2024-05-22 15:27:55', '4', '创意超前'),
(300010, 100010, 200034, 'maddisoncampbell34@example.com', 'MaddisonCampbell', '2024-05-23 12:36:39', '5', '好....震撼又恐怖题材的题材 给第一次接触这种电影的我 好大的震感...虚幻 不真实 细思极恐'),
(300011, 100011, 200046, 'ethanwood46@example.com', 'EthanWood', '2024-05-22 21:09:42', '4.5', '让人潸然泪下，会计踩着先人的墓碑前往光明的、死亡的拯救之路，他永远都不会忘记这个拯救同胞的异乡人'),
(300012, 100012, 200044, 'jacksonturner44@163.com', 'JacksonTurner', '2024-05-23 09:28:46', '5', '是看了无数次的电影，狗是人类最忠实的朋友'),
(300013, 100013, 200019, 'robertmartin19@163.com', 'RobertMartin', '2024-05-22 20:58:14', '5', '我出生在这里，我还要往哪里去。'),
(300014, 100014, 200015, 'michaelbrown15@qq.com', 'MichaelBrown', '2024-05-23 11:06:46', '4.5', '这部电影在看的过程中给了我很多的快乐，但是看过之后，我的心里又有淡淡的忧伤，我无法确定自己如果面对困境，能不能像他们一样这么豁达'),
(300015, 100015, 200025, 'brianjohnson25@163.com', 'BrianJohnson', '2024-05-23 12:51:04', '4.5', '善良、爱心和音乐能感化他人'),
(300016, 100016, 200002, 'example2@example.com', 'user001', '2024-05-22 21:54:51', '4', '好可爱好单纯的瓦力，在孤寂的地球上收集各种有意思的小东西聊以抚慰孤独的心，始终拥有一颗坚定奔向eva的心。'),
(300017, 100017, 200031, 'noahmoore31@example.com', 'NoahMoore', '2024-05-22 22:49:47', '4.5', '树懒好好笑，还有那个小兔子好凶，好可爱。'),
(300018, 100018, 200039, 'liamwilson39@google.com', 'LiamWilson', '2024-05-23 12:48:41', '5', '好电影是只能一个人看的，而且要隔几年就看一遍。港片的高光时刻，更是各位影帝的闪耀！');
